# ModuleSettings Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ModuleSettings Members
ModuleSettings Class Constructors Methods Properties See Also
---
The ModuleSettings type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ModuleSettings | Constructs a new module settings. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ModuleSettings |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Description | The module description. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| MacroLanguageType | The Macro language type. |
| Name | The module name. |

# See Also
ModuleSettings Class
Autodesk.Revit.DB.Macros Namespace